# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
# code
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
no_1 = pd.Series(np.random.randint(1, high=5, size=100))
no_2= pd.Series(np.random.randint(1, high=4, size=100))
no_3 = pd.Series(np.random.randint(10000, high=30001, size=100))
print(no_1, no_2 , no_3)

0     1
1     4
2     3
3     2
4     4
     ..
95    4
96    3
97    3
98    3
99    2
Length: 100, dtype: int32 0     3
1     2
2     3
3     2
4     3
     ..
95    3
96    1
97    3
98    1
99    2
Length: 100, dtype: int32 0     13729
1     10375
2     22849
3     13947
4     22029
      ...
95    24526
96    13150
97    15723
98    27773
99    21666
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
Housing_Market= pd.concat([no_1, no_2, no_3], axis=1)
Housing_Market.head()

   0  1      2
0  1  3  13729
1  4  2  10375
2  3  3  22849
3  2  2  13947
4  4  3  22029

### Step 4. Change the name of the columns to bedrooms, bathrooms, price_sqr_meter

In [4]:
Housing_Market.rename(columns = {0: 'bedroom', 1: 'bathrooms', 2: 'price_sqr_meter'}, inplace=True)
Housing_Market.head()

   bedroom  bathrooms  price_sqr_meter
0        1          3            13729
1        4          2            10375
2        3          3            22849
3        2          2            13947
4        4          3            22029

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:
# code
bigcolumn = pd.DataFrame(pd.concat([no_1, no_2, no_3]))
bigcolumn

        0
0       1
1       4
2       3
3       2
4       4
..    ...
95  24526
96  13150
97  15723
98  27773
99  21666

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [6]:
# code
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [7]:
# code
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        1
1        4
2        3
3        2
4        4
..     ...
295  24526
296  13150
297  15723
298  27773
299  21666

[300 rows x 1 columns]